In [3]:
# Dependencies
import pandas as pd
import requests
import json

# OpenWeather & gmaps API Keys
from config import (api_key,gkey)

cities_pd = pd.read_csv("../Resources/census_city.csv")

# Save config information
url = "http://api.openweathermap.org/data/2.5/weather?"

cities_pd.head()

   Unnamed: 0                 City_State  Population        Lat         Lng
0        2838          Las Vegas, Nevada    626637.0  36.169941 -115.139830
1        3411    Albuquerque, New Mexico    559202.0  35.084386 -106.650422
2        4321  Charlotte, North Carolina    841611.0  35.227087  -80.843127
3        4439         New York, New York   8443713.0  40.712775  -74.005973
4        6654             Columbus, Ohio    867628.0  39.961176  -82.998794